Revit 2026 API

# ExportLineweightKey(ExportLineweightKey) Constructor

---

Constructs a new copy of the input ExportLineweightKey object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportLineweightKey(
	ExportLineweightKey other
)
```
```vb
Public Sub New (
	other As ExportLineweightKey
)
```
```cpp
public:
ExportLineweightKey(
	ExportLineweightKey^ other
)
```
```fsharp
new :
        other : ExportLineweightKey -> ExportLineweightKey
```

#### Parameters

other ExportLineweightKey

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLineweightKey Class

ExportLineweightKey Overload

Autodesk.Revit.DB Namespace